[
    {
        "id": "1lrpd6w",
        "time": "2025-07-04T18:07:43",
        "title": "T+35, REX 068, and Synthetic FTD Rollovers Explained",
        "text": "There’s a lot of confusion around FTDs, T+35 deadlines, and how market makers keep kicking the can. Here’s a full breakdown of how it actually works and how it applies to GME right now.\n\n What is T+35?\n\nWhen a trade fails to deliver (FTD), market makers have 35 trading days to resolve it.\n\nThis is tracked by the NSCC, and T+35 is the final day they are supposed to deliver shares or close out the fail.\n\nExample: If millions of FTDs were created on June 12, then July 17 is the official T+35 deadline.\n\n\n\nWhat is REX Code 068?\n\nIt’s an obscure regulatory exemption that allows clearing members to delay FTD resolution beyond T+35.\n\nBased on historical patterns, REX 068 appears to grant up to 13 extra trading days to delay.\n\nSo a June 12 FTD → July 17 (T+35) → Aug 14–19 (final extension window).\n\n\n\n Why hasn’t GME exploded yet?\n\nBecause they don’t cover FTDs all at once. They:\n\n1. Run the price slightly (e.g., $23 to $25)\n\n\n2. Short it back down to $23–$24\n\n\n3. Use that volume to close a portion of FTDs\n\n\n4. Repeat the cycle, stretching the delivery window\n\n\n\nThis turns the FTD cycle into a negotiable game of supply and sentiment.\n\n\n---\n\n Synthetic FTD Coverage: The Hidden Delay Trick\n\nHere’s what most people miss:\n\n>  They can sell large amounts of deep OTM calls to synthetically cover FTDs.\n\n\n\nThis satisfies some NSCC requirements without delivering real shares\n\nIt gives the appearance of delivery — or the ability to deliver\n\nOnce those calls expire, the new T+35 window starts from the expiration date\n\n\nThis tactic allows market makers to:\n\nDelay real share delivery\n\nControl short-term price action\n\nAvoid breaking regulatory rules\n\n\n\n Why This Matters Right Now\n\nGME had 1.5M+ FTDs around June 12\n\nT+35 = July 17, 2025\n\nREX 068 extension = ~Aug 14–19 window\n\nEarnings land shortly after that\n\n\n> If high retail volume aligns with this window, and shorts get pinned, forced covering can trigger large moves.\n\n\nTL;DR\n\nT+35 = 35 trading days from original fail\n\nREX 068 = up to 13-day extension\n\nOTM calls can be sold to synthetically \"cover\" FTDs\n\nT+35 resets from the day those synthetic calls expire\n\nJuly 17–Aug 19 = High alert window\n\n🔥So if you look at the call chain and price is at $23.50 and there's 10-20k calls near $30 thats not retail thats the synthetic covering, and the new T+35 timer starts at exp of those calls.\n\nStay sharp. Watch volume, options chains, and pressure points. This game isn’t over.\n",
        "score": 150,
        "num_comments": 34,
        "author": "EndDense6286"
    },
    {
        "id": "1lrp1t5",
        "time": "2025-07-04T17:55:09",
        "title": "DFV spotted!!!",
        "text": "Spotted in a video. I know its you! Time to grab my banana!!! Pspspspspspspspspspspspspspspspspspspspspspspspspsppspsspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspspsp gme\n\nhttps://www.reddit.com/r/cats/s/fTFCM6OFe6",
        "score": 61,
        "num_comments": 4,
        "author": "321DoodyBooty"
    },
    {
        "id": "1lroxqq",
        "time": "2025-07-04T17:50:26",
        "title": "Buying until i become a whale",
        "text": "",
        "score": 1359,
        "num_comments": 18,
        "author": "No_Buyer1005"
    },
    {
        "id": "1lroc5t",
        "time": "2025-07-04T17:25:26",
        "title": "Trying to load in external save file in psx",
        "text": "I have a few psx games, but a couple of them I want to just have access to all the levels of the game - I have looked for save files and found one with a file extension gme - however when i put this into the saves folder on Retrobat, it does nothing to the game. I keep googling and it keeps giving me information about  save states but this is not what im looking for.\n\n  \nHelp appreciated!",
        "score": 0,
        "num_comments": 3,
        "author": "Dirty_Toenails"
    },
    {
        "id": "1lro9qw",
        "time": "2025-07-04T17:22:34",
        "title": "Who is the GOAT that got this?? This has to be a true og ape",
        "text": "",
        "score": 259,
        "num_comments": 38,
        "author": "emoson2121"
    },
    {
        "id": "1lro2oz",
        "time": "2025-07-04T17:14:27",
        "title": "TRYING SOMETHING NEW OUT.",
        "text": "Will be available next week in shop as I’m on vacation this week. No number you pick . There are gems hidden in these packs . Double the amount you get at GME for only $25 bucks. There were 30 now only 26 left. You get a parallel combo guaranteed , 13 gems in total in the mix of 30. 1 pack is stacked with parallels. Great value overall. I’d like to just ship and you can post your mystery hits. \nHave fun hunting. \nhttps://www.whatnot.com/s/nV17r40v",
        "score": 10,
        "num_comments": 3,
        "author": "CaseBig576"
    },
    {
        "id": "1lrmzl3",
        "time": "2025-07-04T16:29:16",
        "title": "Has GameStop Forged a Cost Path Toward Sustainable Profitability? (Spoiler: Yes, yes they have. Well done apes and RC 👏we are unstoppable 💪)",
        "text": "GameStop Corp. GME delivered a notable improvement in its fiscal first-quarter 2025 results, driven largely by disciplined cost management and improved operational efficiency. The company slashed adjusted SG&A expenses by 24.8% year over year, bringing the metric down to $225.3 million. As a percentage of net sales, adjusted SG&A improved 320 basis points to 30.8%. This underscores management’s efforts to streamline operations and enhance efficiency without undermining core business functions.\n\nThe company’s cost discipline supported a 3.4% rise in gross profit, which increased to $252.8 million from $244.5 million. Gross margin expanded significantly by 680 basis points to 34.5%, highlighting improved pricing and cost control. Despite declining revenues, GameStop managed to protect its product-level profitability.\n\nOperationally, GameStop saw strong gains. Adjusted EBITDA turned positive at $38.6 million, reversing a loss of $37.6 million in the prior year. Adjusted operating income also improved significantly, reaching $27.5 million in contrast to a loss of $55 million in the last year. \n\nGameStop’s bottom-line performance further highlighted the benefits of its cost restructuring. The company shifted from a net loss of $32.3 million to a net income of $44.8 million in the first quarter of fiscal 2025. Adjusted net income improved to $83.1 million from a loss of $36.7 million, with adjusted earnings per share rising to 17 cents from an adjusted loss of 12 cents in the prior-year quarter. \n\nHowever, net sales declined 17% year over year, due to weakness in hardware and software. Growth in the collectibles segment offered some offset, but long-term success will depend on stabilizing core revenues and scaling newer growth areas.\n\n",
        "score": 49,
        "num_comments": 0,
        "author": "Krunk_korean_kid"
    },
    {
        "id": "1lrlzue",
        "time": "2025-07-04T15:47:25",
        "title": "A ballad full of longing: Liu Yu Ning sings “我只愿” for Endless Journey of Love (2025 OST)",
        "text": "# 🎶 *我只愿* (*I Only Wish*) – by Liu Yu Ning  \n*Emotional theme from the animated feature film* **_Endless Journey of Love_** (《时间之子》), released May 30, 2025.  \n\n📺 Official MV: https://youtu.be/fGmeRxRsRUc\n\n---\n\n### ℹ️ About the Film & Song  \n_**Endless Journey of Love**_ is a Chinese animated fantasy-romance adventure directed by Yu Ao & Zhou Tienan, produced by Shanghai Maoyan, and released on May 30, 2025. It follows a stern assassin and a village girl connected by a mystical time device, whose bond unfolds across time.\n\nLiu Yu Ning’s **“我只愿”** serves as the film’s *emotional theme song*, with lyrics by **Jin CanCan** and music/production by **Qian Lei**. Released alongside the movie, the song plays a key role in the film’s narrative and tone, setting out for a beautiful atmosphere.\n\n---\n\n### 🔥 Buzz & Reception  \n- The film topped Maoyan’s “Want to See” charts for 22 consecutive days during the Dragon Boat Festival window.  \n- The MV, released simultaneously, has received praise for its cinematic feel and Liu Yu Ning’s powerful delivery.  \n- Fans have called it one of his most moving OST performances to date.\n\n---\n\n### 🎧 My Thoughts  \nI absolutely *love* this track. The intro and guitar solo carry a raw, emotional intensity that **reminds me of Metallica** — not in a derivative way, but in the way great music can stir the same emotional undercurrents: *longing, defiance, memory*. There’s a similar weight to the atmosphere it creates.\n\nLiu Yu Ning’s voice *rings like a bell* — clear, resonant, and deeply emotive. Though he didn’t compose the track himself, his **vocal performance shows remarkable maturity**. He brings depth and emotional honesty to every line, offering a vocal interpretation that feels lived-in and cinematic.\n\nThe song blends lyrical softness with quiet strength. It lingers. And it marks an important step in Liu Yu Ning’s ongoing artistic evolution.\n\n---\n\n## 📝 Translation – *我只愿* (\"I Only Wish\")\n\n**Verse 1**  \nI used my body to become a shield, let it be buried  \nThe deep love poured into time, forming mountain ranges  \nCould I exchange it to shield you from a single storm or snow?  \nI truly wanted to give you forever and ever—and never leave\n\n**Verse 2**  \nDon’t count the days I left with sorrow’s sobbing  \nEven if life rewound, all my choices would remain unchanged  \nDon’t linger in place—the gravestone’s words are glaring; make them lighter  \nLet the warmest light lift your face—that would fulfill the vow\n\n**Pre-Chorus**  \nI can’t sever time with a single farewell  \nYour warm fingertips, I still crave  \nI can only gaze at you deeply one last time  \nRemember everything about you  \nIn that final second, I only wish…\n\n**Chorus**  \nMay the clear spring in your eyes never dry up  \nMay you pass through this world safe and sound  \nI’ll go ahead to the distant lands, planting flowers across a wild plain for you  \nDon’t look back, oh‑oh‑oh‑oh  \nKeep moving forward  \nDon’t look back, oh‑oh‑oh\n\n**Bridge**  \nYou’ve always shone brightly without needing embellishment  \nI feel reluctant—but I’m fortunate—I only wish for this  \nJanuary’s great snow, April’s flying blossoms, July’s dusks  \nThe golden edges of fallen leaves, the shifting aurora—like everything about you  \nAfter a shooting star, the sky is radiant—that’s the wish I made  \nKeep moving forward\n\n**Chorus (reprise)**  \nMay the dead branches you step on bloom into petals  \nMay the sleepless nights you know be warmed by starlight  \nI will accompany the wind every year, planting dandelions by the roadside  \nDon’t bow your head, oh‑oh‑oh‑oh\n\n---\n\n### ✅ TL;DR  \n- **Film**: _Endless Journey of Love_ (《时间之子》), released May 30, 2025  \n- **Song**: *“我只愿”* (*I Only Wish*)  \n- **Singer**: Liu Yu Ning  \n- **Lyrics**: Jin CanCan | **Composer/Producer**: Qian Lei  \n- **Emotional ballad** with a guitar-led intro, echoes of Metallica in tone  \n- Liu Yu Ning’s vocal maturity shines through in this moving OST highlight\n- *Sidenote: I’m not a big fan of (too many) emojis, but I was told many people are finding posts more interesting with them, so trying it out? Is it better like this?*\n\n---\n\nHow do you feel about this song?\n\n",
        "score": 16,
        "num_comments": 0,
        "author": "No-Recipe-7653"
    },
    {
        "id": "1lrlcig",
        "time": "2025-07-04T15:20:34",
        "title": "Threshold Securities -aka Naked Shorts",
        "text": "\n\n [Threshold (stockbuyvest.com)](https://stockbuyvest.com/index.php/en/markets/screeners/threshold) \n\n$AMC $CVNA $GME $NVDA $INTC",
        "score": 1,
        "num_comments": 0,
        "author": "saasfin"
    },
    {
        "id": "1lrl8zr",
        "time": "2025-07-04T15:16:39",
        "title": "Selling Weekly \"Lottos\" - Week 4 - $636 Income with $62,500 Risk.",
        "text": "This weeks winner: Me.\n\nI sold GME 25C x10 for $223 income and MSTR 380P x1 for $413 income.\n\nhttps://preview.redd.it/yc0yixtkivaf1.jpg?width=583&format=pjpg&auto=webp&s=0c50d5f631f4333f57136ffc2e94f37800f9688f\n\n1. Everything is covered. I don't have margin enabled. \n\n\n\n2. I'll be happy to buy the shares or sell the shares at those prices in this time frame.\n\n\n\n3. Its not free money and all investing has the risk of losses.\n\n  \nI've also made a spreadsheet to show the math.\n\nhttps://preview.redd.it/i1tx81jnivaf1.png?width=1334&format=png&auto=webp&s=f062918c14f9a838c585a432569cfb79ec449949\n\n  \nI did reduce my potential annual income due to making less  But I increased my potential yield due to risking less. The most important part here to me is that I made more than week 1 even though I took almost half the risk.\n\n\\_\\_\\_\\_\\_\\_\\_\\_\n\nEli5?\n\n\n\nTo try and explain what I’m doing here lets make up an analogy of a coin flipping game. \n\n\n\nTo play the game you must buy in with $20. Every time you get heads you win. The first win is $10, and every time after that you double your money. You get to flip the coin a maximum of 7 times. The player can choose to stop to collect the winnings. If you get one tails you lose.\n\n\n\nSo total winnings can be $620, for a small price of $20. But the chance to get 7 heads in a row is less than 1%. Even just to break even with 2 heads in a row is 25%. \n\n\n\n3 heads for $20 winnings: 12.5% chance.\n\n\n\n4 heads for a $60 win: 6.25% chance.\n\n\n\n5 heads for $140 win: 3.125% chance.\n\n\n\n6 heads for $300 win: 1.5625% chance.\n\n\n\nI like to be the seller of this game which is why I like to sell weekly lottos. Although I don’t make much, I have a high chance to make the money each time.\n\n\n\n(Note: First time I played this game with my gf she got 5 heads in a row and I had to pay her $140.)\n\n\\_\\_\\_\\_\\_\\_\\_\\_\\_\n\n  \nHappy 4th of July. See you next week.",
        "score": 0,
        "num_comments": 1,
        "author": "himanbansal"
    },
    {
        "id": "1lrkxpe",
        "time": "2025-07-04T15:03:43",
        "title": "Happy Treason Day Gmerica, from the Golden Pinecone!!",
        "text": "",
        "score": 126,
        "num_comments": 10,
        "author": "DynastyFSU2"
    },
    {
        "id": "1lrkfxv",
        "time": "2025-07-04T14:42:58",
        "title": "Lots of opinions on good or bad, but seems like an overall good thing",
        "text": "",
        "score": 36,
        "num_comments": 16,
        "author": "doctorplasmatron"
    },
    {
        "id": "1lrjhu2",
        "time": "2025-07-04T14:02:03",
        "title": "GME hasn't done much since the big dump.",
        "text": "",
        "score": 1,
        "num_comments": 0,
        "author": "PauPauRui"
    },
    {
        "id": "1lrj8dj",
        "time": "2025-07-04T13:50:15",
        "title": "7/3/25 portfolio update",
        "text": "",
        "score": 1,
        "num_comments": 0,
        "author": "expired_regard"
    },
    {
        "id": "1lri7de",
        "time": "2025-07-04T13:01:55",
        "title": "🔮 meirl every time pathetic shills post their latest FUD campaigns 🔥💥🍻",
        "text": "",
        "score": 125,
        "num_comments": 12,
        "author": "Expensive-Two-8128"
    },
    {
        "id": "1lri5uz",
        "time": "2025-07-04T13:00:06",
        "title": "Reddit Stock Tracker (July 04, 2025) - $ADP, $BULL, $DM, $EU, $GME, $HOOD, $IBKR, $ICE, $PLTR, $TSLA",
        "text": "",
        "score": 1,
        "num_comments": 0,
        "author": "Ornery_Hand_8626"
    },
    {
        "id": "1lri10s",
        "time": "2025-07-04T12:53:25",
        "title": "$NVA A futur WORLD champion in mining Gold 🇺🇸",
        "text": "Minéraux Nova $NVA en Alaska 🇺🇸\n\n🔶 1. Aperçu • Symbole : ASX : NVA | OTCQB:NVAAF | NASDAQ : NVA • Actif phare : Estelle Gold District – Alaska (détenu à 100 %) • Métaux : Or (primaire), Antimoine (stratégique) • Étape : Explorateur avancé / Pré-développement • Capitalisation boursière (juillet 2025) : ~ 65 millions USD • Trésorerie (en mars 2025) : ~9 millions de dollars – Zéro dette • Augmentation de capital imminente (arrêtée sur l'ASX) – ThinkEquity en tant que souscripteur principal • Nouvellement coté au NASDAQ → Exposition croissante au détail aux États-Unis\n\n⸻\n\n📈 2. Indicateurs clés du projet – District d'Estelle (Alaska)\n\nValeur / Statut de la métrique Ressources totales en or (MRE) 9,9 Moz Au (Korbel, RPM, Train, Shoeshine) Démarreur de haute qualité (RPM) 2,1 Moz à 2,0 g/t Au Production prévue ~ 200 000 onces/an d’ici 2027 (RPM uniquement, phase initiale) Coût de maintien tout compris (AISC) < 900 $/oz (très faible coût) Forage en cours (2025) 15 000 m (expansion RPM + zone Stibium) Cible du district > 10–15 Moz Au + potentiel antimoine Angle stratégique Potentiellement premier producteur américain d’antimoine (minéral critique)\n\n⸻\n\n🚀 3. Pourquoi Nova pourrait devenir une future « action mème » aurifère\n\n🔥 Détails du facteur NASDAQ uplisting accès au détail aux États-Unis + banquier ThinkEquity = haute visibilité Nano-cap avec des méga-ressources Capitalisation boursière de 65 millions de dollars contre >10 Moz d'or dans le sol Actif national américain basé en Alaska, aucun risque géopolitique → idéal pour les acheteurs institutionnels Exposition à l'antimoine Métaux critiques, cotés par la DPA, un argument fort pour le secteur de la défense américain Faible flottant / structure d'action serrée Encore au début du cycle de dilution Levier du prix de l’or Très sensible au rallye de l’or (voir ci-dessous) Prêt pour FinTwit Premiers signes d'intérêt viral - configuration du graphique + récit « or 2.0 » Potentiel de fusions et acquisitions Cible privilégiée pour Newmont / Agnico / Kinross avec plus de 10 Moz sur le sol américain\n\n⸻\n\n📊 4. Simulation de valorisation — Exploité par l'or\n\nEn supposant une production de 200 000 onces/an à un AISC de 900 $, voici les flux de trésorerie disponibles hypothétiques et l’estimation de la juste valeur de Nova selon différents scénarios de prix de l’or (avant impôts, sans investissements) :\n\n🟡 Prix de l'or ($/oz) 💰 Marge/oz 📈 FCF/an (200k oz) 🔢 Valorisation 10× FCF 💵 Juste valeur par ADS 2 800 $ 1 900 $ 380 M$ 3,8 G$ 55 à 65 $/ADS 3 500 $ 2 600 $ 520 millions de dollars 5,2 milliards de dollars 75 à 90 $/ADS 4 000 $ 3 100 $ 620 M$ 6,2 G$ 95-110 $/ADS 5 000 $ 4 100 $ 820 millions de dollars 8,2 milliards de dollars 130 à 150 $/ADS 10 000 $ 9 100 $ 1,82 milliard de dollars 18,2 milliards de dollars 300 à 350 $/ADS\n\n🔍 Ces chiffres sont purement illustratifs et supposent : – Pas de taxes/investissements inclus – Pas d’onces supplémentaires de Train/Korbel (juste RPM) – Pas de dilution suite à une augmentation à venir – 10× FCF multiple (conservateur pour l’or de longue durée et à faible coût)\n\n⸻\n\n📉 5. Facteurs de risque • ⚠️ En attente de dilution suite à la prochaine augmentation de capital (dirigée par ThinkEquity) • ⚙️ Étude de préfaisabilité (PFS) en cours – exécution nécessaire • 📉 Liquidité faible – potentiel de volatilité élevé • 🌍 Exposition aux matières premières – repose sur le maintien du prix de l'or à un niveau élevé. • 🧾 Risque lié aux permis : faible en Alaska, mais toujours préoccupant\n\n>>> CATALYSEURS GLOBAL \n\n🚀✅ RÉÉVALUATION sous BESSENT secrétaire au Trésor de Trump, devrait se produite et faire rentrer BESSENT & TRUMP dans l histoire\n*BESSENT aime l or et a déjà donné un interview  qui allé dans ce sens \n\n🚀✅ Bâle 3 lancé le 1er juillet \n\n🚀✅ Les banques centrales ont massivement acheter l or, les chinois aussi et ils sont entrain de prendre de vitesse les US 🇺🇸 sur l OR \n\n🚀✅ Le BTC ne pourra réellement exister comme monnaie 💴 si il est rataché a une entité physique comme l or \n\n🚀✅ L or stablecloin arrive \n\n⸻\n\n🧨 Interprétation • À 2800 $ l'once : Nova entre dans un territoire de sous-valorisation brutale (avec un potentiel x30 vs. aujourd'hui). • À 3500 $–4000 $ : devient un candidat sérieux au club des « mid-tiers goldproducers » sur NASDAQ, avec fort intérêt institutionnel. • À 5000 $ : entre dans un scénario de revalorisation explosive – potentiel stock culte retail type Palantir / GME. • À 10 000 $ : Nova devient une licorne aurifère avec un des meilleurs effets de levier du marché.",
        "score": 1,
        "num_comments": 0,
        "author": "WarrenBG"
    },
    {
        "id": "1lrhnka",
        "time": "2025-07-04T12:34:39",
        "title": "Week 27 wheel update",
        "text": "Happy independence day to those of you in the US!\n\n\nTotal premiums collected for week 27: $486.75\n\n\nThis week's trades:\n\nCSP: ASTS, RGTI, HIMS, LUNR, GME, PLTR\n\nCC: BULL, FUBO, LUNR\n\n\nGood week of trading with most contracts expiring OTM. I had a couple rolls and one assignment on GME. For next week I'll be weighing my options on my open SHOP CC that's far ITM. Time to decide if I should roll farther or let it get called away.\n\n\nIm thinking of adding a couple extra images to next week's post showing current holdings and some graphs of weekly premiums and weekly account value. Not sure if that will add value though, let me know your thoughts. \n\n\n\nYTD results:\n\nReturn from premiums: 21.10%\n\nReturn from portfolio: -9.59%\n\nTotal account return: 11.42%      \n\n\n     \n\nDisclaimer: returns are calculated assuming open short positions will expire in their current state, OTM or ITM.",
        "score": 18,
        "num_comments": 7,
        "author": "expired_regard"
    },
    {
        "id": "1lrfzd1",
        "time": "2025-07-04T11:02:16",
        "title": "Why does the \"analysis\" tool on charts not work for every stock?",
        "text": "Is there a way to request a certain stock to be included in the trade central software that powers the \"analysis\" feature on chart? Or is this a fidelity/UI issue? Stock not working for is GME. Thank you",
        "score": 1,
        "num_comments": 0,
        "author": "bowie9191"
    },
    {
        "id": "1lrft10",
        "time": "2025-07-04T10:51:49",
        "title": "Made my target!",
        "text": "Finally made it to my (first) target!\n\nMoass can start now, thank you for waiting!\n\nWord limit text.\nWord limit text.\nWord limit text.\nWord limit text.\nWord limit text.\nWord limit text.\nWord limit text.\nWord limit text.\nWord limit text.\nWord limit text.\n",
        "score": 1719,
        "num_comments": 31,
        "author": "PuzzledHoneydew799"
    },
    {
        "id": "1lrdebg",
        "time": "2025-07-04T08:14:46",
        "title": "Hoping this isn’t shot down, but…",
        "text": "Hi all! I’m currently in Japan right now, but I was wondering if anyone would be interested in a short bought from the Jump Store? It’s an Extra Large, and I can’t fit it properly, so I thought to come here. If It’s against the rules, I’m sorry!",
        "score": 215,
        "num_comments": 19,
        "author": "HighlightFirst7728"
    },
    {
        "id": "1lrcy2w",
        "time": "2025-07-04T07:44:36",
        "title": "Some basic questions from a potential new player",
        "text": "Hello!\n\nA good friend of mine has just recently started playing this game and has been speaking very highly of it. I my self am not much of an IPhone gamer but thought since it's so accessible and comes so highly recommended that I might give it a shot. Before I do, I just had one really basic question I wanted to ask. I was just curious and wanted to know how much of the gme would be locked behind a paywall? I know that the Applevis site says it's free with in app purchase. Money is really tight for me right now so I just wanted to know how much of the game will I be able to play before I run up against locked content, or will I be able to watch ads to get around that somehow?\nThanks in advance for any information you can give. I'm really interested in exploring this title assuming not too much of it will be restricted to those of us who are just barely getting by.",
        "score": 3,
        "num_comments": 4,
        "author": "DarkAngelCat1215"
    },
    {
        "id": "1lrcl8g",
        "time": "2025-07-04T07:20:24",
        "title": "I have watched almost all of Yim Siwan's series and movies",
        "text": "And here are what I liked and didn't liked:\n\n\nThese are the series that I enjoyed, ranked from most to the least:\n\n1. Misaeng\n\n2. Boyhood\n\n3. Strangers From Hell\n\n4. Actors on Journey\n\n5. Squid Games\n\n6. Tracer\n\nHis movies that I enjoyed, ranked from most to the least:\n\n1. The Merciless \n\n2. Road to Boston\n\n3. Unlocked\n\n4. The Attorney\n\n5. A Melody to Remember \n\n6. One-Line\n\nThose that I didn't really like but endured finishing because I like staring at his face:\n\n1. Summer Strike\n\n2. Run On\n\nThose I decided to just drop:\n\n1. The King in Love\n\n2. The Triangle",
        "score": 56,
        "num_comments": 34,
        "author": "coelililia"
    },
    {
        "id": "1lrcb3h",
        "time": "2025-07-04T07:01:46",
        "title": "$GME Daily Directory | New? Start Here! | Discussion, DRS Guide, DD Library, Monthly Forum, and FAQs",
        "text": "How do I [feed DRSBOT](https://www.reddit.com/r/GMEOrphans/comments/qlvour/welcome_to_gmeorphans_read_this_post/)? Get a [user flair](https://www.reddit.com/r/Superstonk/comments/yuarvq/how_to_get_a_userflair_on_superstonk_new_emojis)? Hide [post flairs and find old posts](https://www.reddit.com/r/Superstonk/comments/v0oxp2/how_to_filter_by_flair_search_for_posts_on/)?\n\n[Reddit & Superstonk Moderation FAQ](https://www.reddit.com/r/Superstonk/wiki/index/reddit-faq/)\n\nOther [GME Subreddits](https://www.reddit.com/r/Superstonk/about/wiki/index/gme_communities/)\n\n# 📚 Library of Due Diligence [GME.fyi](https://fliphtml5.com/bookcase/kosyg)\n\n>\n\n# 🟣 [Computershare Megathread](https://www.reddit.com/r/Superstonk/comments/1ch3lrh/questions_about_direct_registering_ask_here_have/)\n\n>\n\n# 🍌 [Monthly Open Forum](https://www.reddit.com/r/Superstonk/comments/1dpvb1f/open_forum_july_2024/)\n\n>\n\n# 🔥 Join our [Discord](https://discord.com/invite/y4dK3y5DXJ) 🔥",
        "score": 195,
        "num_comments": 148,
        "author": "AutoModerator"
    },
    {
        "id": "1lrc31t",
        "time": "2025-07-04T06:47:32",
        "title": "GME en av de mest handlede aksjene på DNB internasjonalt",
        "text": "Jeg kjøper selv en del GME på DNB (ca 1500 aksjer der), er det flere her som gjør det? (har 60% av aksjene DRS) men resten på DNB. Handlede aksjer kan være både kjøp og salg, men vi tror vel det i all hovedsak er kjøp her? ;)",
        "score": 49,
        "num_comments": 11,
        "author": "vikingmonkey6969"
    },
    {
        "id": "1lrbozb",
        "time": "2025-07-04T06:22:47",
        "title": "487 of the last 768 trading days with short volume above 50%.Yesterday 45.16%⭕️30 day avg 58.33%⭕️SI 81.74M⭕️",
        "text": "",
        "score": 95,
        "num_comments": 1,
        "author": "Affectionate_Use_606"
    },
    {
        "id": "1lrbos8",
        "time": "2025-07-04T06:22:26",
        "title": "487 of the last 768 trading days with short volume above 50%.Yesterday 45.16%⭕️30 day avg 58.33%⭕️SI 81.74M⭕️",
        "text": "",
        "score": 208,
        "num_comments": 2,
        "author": "Affectionate_Use_606"
    },
    {
        "id": "1lrb8u3",
        "time": "2025-07-04T05:55:03",
        "title": "Diamantenhände 💎👐 German market is open 🇩🇪",
        "text": "Guten Morgen to this global band of Apes! 👋🦍\n\nWith the holiday today, I will be bringing a full day of updates from the German Exchanges.\nWill you join me?\n\n\n\nToday is Friday, July 4th, and you know what that means! Join other apes around the world to watch infrequent updates from the German markets!\n\n###🚀 Buckle Up! 🚀\n***\n\n\n- 🟥 840 minutes in: **$23.67 / 20,09 €**  *(volume: 46327)*\n- 🟥 835 minutes in: $23.69 / 20,10 €  *(volume: 46324)*\n- ⬜ 830 minutes in: $23.72 / 20,13 €  *(volume: 45624)*\n- ⬜ 825 minutes in: $23.72 / 20,13 €  *(volume: 45620)*\n- ⬜ 820 minutes in: $23.72 / 20,13 €  *(volume: 45555)*\n- ⬜ 815 minutes in: $23.72 / 20,13 €  *(volume: 45535)*\n- ⬜ 810 minutes in: $23.72 / 20,13 €  *(volume: 45535)*\n- ⬜ 805 minutes in: $23.72 / 20,13 €  *(volume: 45335)*\n- 🟥 800 minutes in: $23.72 / 20,13 €  *(volume: 45335)*\n- 🟩 795 minutes in: $23.77 / 20,18 €  *(volume: 45335)*\n- ⬜ 790 minutes in: $23.63 / 20,06 €  *(volume: 44587)*\n- ⬜ 785 minutes in: $23.63 / 20,06 €  *(volume: 44582)*\n- ⬜ 780 minutes in: $23.63 / 20,06 €  *(volume: 44578)*\n- ⬜ 775 minutes in: $23.63 / 20,06 €  *(volume: 44566)*\n- ⬜ 770 minutes in: $23.63 / 20,06 €  *(volume: 44366)*\n- ⬜ 765 minutes in: $23.63 / 20,06 €  *(volume: 44315)*\n- ⬜ 760 minutes in: $23.63 / 20,06 €  *(volume: 44315)*\n- ⬜ 755 minutes in: $23.63 / 20,06 €  *(volume: 44315)*\n- ⬜ 750 minutes in: $23.63 / 20,06 €  *(volume: 44305)*\n- 🟥 745 minutes in: $23.63 / 20,06 €  *(volume: 44305)*\n- ⬜ 740 minutes in: $23.70 / 20,12 €  *(volume: 44232)*\n- ⬜ 735 minutes in: $23.70 / 20,12 €  *(volume: 44232)*\n- ⬜ 730 minutes in: $23.70 / 20,12 €  *(volume: 44231)*\n- ⬜ 725 minutes in: $23.70 / 20,12 €  *(volume: 44114)*\n- ⬜ 720 minutes in: $23.70 / 20,12 €  *(volume: 44089)*\n- 🟩 715 minutes in: $23.70 / 20,12 €  *(volume: 44088)*\n- 🟩 710 minutes in: $23.63 / 20,06 €  *(volume: 44077)*\n- ⬜ 705 minutes in: $23.58 / 20,02 €  *(volume: 44003)*\n- 🟥 700 minutes in: $23.58 / 20,02 €  *(volume: 43953)*\n- 🟩 695 minutes in: $23.63 / 20,06 €  *(volume: 43953)*\n- 🟥 690 minutes in: $23.60 / 20,03 €  *(volume: 43946)*\n- ⬜ 685 minutes in: $23.70 / 20,12 €  *(volume: 43934)*\n- 🟩 680 minutes in: $23.70 / 20,12 €  *(volume: 43834)*\n- ⬜ 675 minutes in: $23.63 / 20,06 €  *(volume: 43774)*\n- ⬜ 670 minutes in: $23.63 / 20,06 €  *(volume: 43774)*\n- 🟥 665 minutes in: $23.63 / 20,06 €  *(volume: 43749)*\n- 🟥 660 minutes in: $23.70 / 20,12 €  *(volume: 43746)*\n- ⬜ 655 minutes in: $23.71 / 20,12 €  *(volume: 43743)*\n- ⬜ 650 minutes in: $23.71 / 20,12 €  *(volume: 43723)*\n- ⬜ 645 minutes in: $23.71 / 20,12 €  *(volume: 43723)*\n- 🟩 640 minutes in: $23.71 / 20,12 €  *(volume: 43723)*\n- ⬜ 635 minutes in: $23.63 / 20,06 €  *(volume: 43601)*\n- 🟥 630 minutes in: $23.63 / 20,06 €  *(volume: 43601)*\n- ⬜ 625 minutes in: $23.71 / 20,12 €  *(volume: 43376)*\n- ⬜ 620 minutes in: $23.71 / 20,12 €  *(volume: 43256)*\n- ⬜ 615 minutes in: $23.71 / 20,12 €  *(volume: 43256)*\n- ⬜ 610 minutes in: $23.71 / 20,12 €  *(volume: 43225)*\n- ⬜ 605 minutes in: $23.71 / 20,12 €  *(volume: 43219)*\n- ⬜ 600 minutes in: $23.71 / 20,12 €  *(volume: 43209)*\n- ⬜ 595 minutes in: $23.71 / 20,12 €  *(volume: 43009)*\n- ⬜ 590 minutes in: $23.71 / 20,12 €  *(volume: 42905)*\n- 🟩 585 minutes in: $23.71 / 20,12 €  *(volume: 42897)*\n- ⬜ 580 minutes in: $23.67 / 20,09 €  *(volume: 42847)*\n- 🟥 575 minutes in: $23.67 / 20,09 €  *(volume: 42847)*\n- 🟥 570 minutes in: $23.70 / 20,11 €  *(volume: 42847)*\n- ⬜ 565 minutes in: $23.74 / 20,15 €  *(volume: 41121)*\n- 🟩 560 minutes in: $23.74 / 20,15 €  *(volume: 40941)*\n- ⬜ 555 minutes in: $23.71 / 20,12 €  *(volume: 39922)*\n- 🟩 550 minutes in: $23.71 / 20,12 €  *(volume: 39894)*\n- ⬜ 545 minutes in: $23.71 / 20,12 €  *(volume: 39787)*\n- 🟩 540 minutes in: $23.71 / 20,12 €  *(volume: 39787)*\n- 🟩 535 minutes in: $23.67 / 20,09 €  *(volume: 39632)*\n- 🟩 530 minutes in: $23.62 / 20,05 €  *(volume: 39632)*\n- ⬜ 525 minutes in: $23.57 / 20,01 €  *(volume: 39322)*\n- ⬜ 520 minutes in: $23.57 / 20,01 €  *(volume: 39317)*\n- ⬜ 515 minutes in: $23.57 / 20,01 €  *(volume: 39296)*\n- 🟥 510 minutes in: $23.57 / 20,01 €  *(volume: 39249)*\n- ⬜ 505 minutes in: $23.62 / 20,05 €  *(volume: 38973)*\n- ⬜ 500 minutes in: $23.62 / 20,05 €  *(volume: 38973)*\n- ⬜ 495 minutes in: $23.62 / 20,05 €  *(volume: 38969)*\n- ⬜ 490 minutes in: $23.62 / 20,05 €  *(volume: 38892)*\n- 🟥 485 minutes in: $23.62 / 20,05 €  *(volume: 38887)*\n- 🟩 480 minutes in: $23.62 / 20,05 €  *(volume: 38726)*\n- 🟥 475 minutes in: $23.56 / 20,00 €  *(volume: 38566)*\n- 🟩 470 minutes in: $23.61 / 20,04 €  *(volume: 38527)*\n- 🟩 465 minutes in: $23.61 / 20,04 €  *(volume: 38527)*\n- 🟥 460 minutes in: $23.53 / 19,98 €  *(volume: 38427)*\n- 🟥 455 minutes in: $23.55 / 19,99 €  *(volume: 38369)*\n- 🟥 450 minutes in: $23.57 / 20,00 €  *(volume: 38279)*\n- 🟩 445 minutes in: $23.57 / 20,01 €  *(volume: 37804)*\n- 🟩 440 minutes in: $23.51 / 19,95 €  *(volume: 37019)*\n- 🟥 435 minutes in: $23.50 / 19,95 €  *(volume: 36619)*\n- 🟥 430 minutes in: $23.58 / 20,01 €  *(volume: 33578)*\n- 🟩 425 minutes in: $23.59 / 20,02 €  *(volume: 32529)*\n- 🟥 420 minutes in: $23.56 / 20,00 €  *(volume: 31960)*\n- 🟥 415 minutes in: $23.59 / 20,02 €  *(volume: 31958)*\n- 🟩 410 minutes in: $23.64 / 20,07 €  *(volume: 31256)*\n- 🟩 405 minutes in: $23.64 / 20,06 €  *(volume: 31256)*\n- 🟩 400 minutes in: $23.63 / 20,05 €  *(volume: 30976)*\n- 🟥 395 minutes in: $23.49 / 19,93 €  *(volume: 29908)*\n- 🟥 390 minutes in: $23.49 / 19,94 €  *(volume: 29778)*\n- 🟥 385 minutes in: $23.51 / 19,95 €  *(volume: 29650)*\n- 🟥 380 minutes in: $23.52 / 19,96 €  *(volume: 29577)*\n- 🟥 375 minutes in: $23.56 / 20,00 €  *(volume: 28806)*\n- 🟩 370 minutes in: $23.61 / 20,04 €  *(volume: 28641)*\n- 🟩 365 minutes in: $23.56 / 20,00 €  *(volume: 28631)*\n- ⬜ 360 minutes in: $23.54 / 19,98 €  *(volume: 28631)*\n- 🟥 355 minutes in: $23.54 / 19,98 €  *(volume: 28514)*\n- 🟥 350 minutes in: $23.55 / 19,98 €  *(volume: 28489)*\n- ⬜ 345 minutes in: $23.62 / 20,05 €  *(volume: 28452)*\n- ⬜ 340 minutes in: $23.62 / 20,05 €  *(volume: 28422)*\n- 🟩 335 minutes in: $23.62 / 20,05 €  *(volume: 27973)*\n- 🟩 330 minutes in: $23.58 / 20,01 €  *(volume: 25497)*\n- 🟩 325 minutes in: $23.56 / 20,00 €  *(volume: 24997)*\n- 🟥 320 minutes in: $23.56 / 20,00 €  *(volume: 24943)*\n- 🟩 315 minutes in: $23.57 / 20,01 €  *(volume: 24743)*\n- 🟥 310 minutes in: $23.57 / 20,01 €  *(volume: 24678)*\n- 🟩 305 minutes in: $23.58 / 20,01 €  *(volume: 24658)*\n- ⬜ 300 minutes in: $23.54 / 19,98 €  *(volume: 24158)*\n- 🟥 295 minutes in: $23.54 / 19,98 €  *(volume: 24107)*\n- 🟩 290 minutes in: $23.54 / 19,98 €  *(volume: 24072)*\n- 🟩 285 minutes in: $23.52 / 19,96 €  *(volume: 24014)*\n- 🟥 280 minutes in: $23.51 / 19,96 €  *(volume: 23951)*\n- 🟩 275 minutes in: $23.54 / 19,98 €  *(volume: 23866)*\n- 🟩 270 minutes in: $23.52 / 19,97 €  *(volume: 23582)*\n- ⬜ 265 minutes in: $23.49 / 19,94 €  *(volume: 23580)*\n- ⬜ 260 minutes in: $23.49 / 19,94 €  *(volume: 23532)*\n- 🟥 255 minutes in: $23.49 / 19,94 €  *(volume: 23532)*\n- 🟥 250 minutes in: $23.53 / 19,97 €  *(volume: 23507)*\n- 🟩 245 minutes in: $23.62 / 20,05 €  *(volume: 22880)*\n- 🟥 240 minutes in: $23.57 / 20,00 €  *(volume: 21444)*\n- 🟥 235 minutes in: $23.59 / 20,02 €  *(volume: 21418)*\n- 🟩 230 minutes in: $23.59 / 20,03 €  *(volume: 20097)*\n- 🟩 225 minutes in: $23.51 / 19,95 €  *(volume: 16803)*\n- 🟥 220 minutes in: $23.49 / 19,94 €  *(volume: 14849)*\n- 🟩 215 minutes in: $23.64 / 20,06 €  *(volume: 10269)*\n- 🟩 210 minutes in: $23.62 / 20,05 €  *(volume: 8705)*\n- 🟩 205 minutes in: $23.62 / 20,05 €  *(volume: 8168)*\n- 🟩 200 minutes in: $23.62 / 20,04 €  *(volume: 8100)*\n- ⬜ 195 minutes in: $23.60 / 20,03 €  *(volume: 8079)*\n- 🟥 190 minutes in: $23.60 / 20,03 €  *(volume: 7695)*\n- 🟩 185 minutes in: $23.60 / 20,03 €  *(volume: 7695)*\n- 🟥 180 minutes in: $23.60 / 20,03 €  *(volume: 7669)*\n- 🟩 175 minutes in: $23.68 / 20,10 €  *(volume: 7134)*\n- 🟥 170 minutes in: $23.68 / 20,10 €  *(volume: 7132)*\n- 🟩 165 minutes in: $23.70 / 20,11 €  *(volume: 6632)*\n- 🟥 160 minutes in: $23.68 / 20,10 €  *(volume: 6601)*\n- 🟥 155 minutes in: $23.75 / 20,16 €  *(volume: 6519)*\n- 🟩 150 minutes in: $23.75 / 20,16 €  *(volume: 6519)*\n- 🟥 145 minutes in: $23.74 / 20,15 €  *(volume: 6420)*\n- 🟩 140 minutes in: $23.77 / 20,18 €  *(volume: 6295)*\n- 🟥 135 minutes in: $23.74 / 20,15 €  *(volume: 5655)*\n- 🟥 130 minutes in: $23.74 / 20,15 €  *(volume: 5553)*\n- 🟩 125 minutes in: $23.78 / 20,18 €  *(volume: 5010)*\n- 🟩 120 minutes in: $23.70 / 20,12 €  *(volume: 4916)*\n- 🟩 115 minutes in: $23.67 / 20,09 €  *(volume: 4916)*\n- 🟩 110 minutes in: $23.65 / 20,07 €  *(volume: 4624)*\n- 🟩 105 minutes in: $23.64 / 20,06 €  *(volume: 4574)*\n- 🟥 100 minutes in: $23.60 / 20,03 €  *(volume: 4574)*\n- 🟥 95 minutes in: $23.63 / 20,05 €  *(volume: 3700)*\n- 🟥 90 minutes in: $23.66 / 20,08 €  *(volume: 3350)*\n- 🟥 85 minutes in: $23.68 / 20,10 €  *(volume: 2313)*\n- 🟩 80 minutes in: $23.68 / 20,10 €  *(volume: 2148)*\n- 🟥 75 minutes in: $23.65 / 20,07 €  *(volume: 2128)*\n- 🟩 70 minutes in: $23.67 / 20,09 €  *(volume: 1976)*\n- 🟥 65 minutes in: $23.62 / 20,05 €  *(volume: 1544)*\n- 🟥 60 minutes in: $23.67 / 20,09 €  *(volume: 1131)*\n- 🟥 55 minutes in: $23.67 / 20,09 €  *(volume: 1131)*\n- ⬜ 50 minutes in: $23.67 / 20,09 €  *(volume: 1081)*\n- 🟥 45 minutes in: $23.67 / 20,09 €  *(volume: 1013)*\n- 🟩 40 minutes in: $23.67 / 20,09 €  *(volume: 1013)*\n- 🟩 35 minutes in: $23.67 / 20,09 €  *(volume: 907)*\n- 🟥 30 minutes in: $23.62 / 20,05 €  *(volume: 676)*\n- 🟩 25 minutes in: $23.67 / 20,09 €  *(volume: 580)*\n- 🟩 20 minutes in: $23.67 / 20,09 €  *(volume: 530)*\n- 🟥 15 minutes in: $23.62 / 20,05 €  *(volume: 507)*\n- 🟥 10 minutes in: $23.64 / 20,07 €  *(volume: 501)*\n- 🟥 5 minutes in: $23.65 / 20,07 €  *(volume: 501)*\n- 🟩 0 minutes in: $23.65 / 20,07 €  *(volume: 491)*\n\n\n\n***\n[Link to previous Diamantenhände post](http://www.reddit.com/r/Superstonk/comments/1lqi082/diamantenhände_german_market_is_open/)\n\nFAQ: I'm capturing current price and volume data from German exchanges and converting to USD. Today's euro -> USD conversion ratio is 1.1782. I programmed a tool that assists me in fetching this data and updating the post. If you'd like to check current prices directly, you can check [Lang & Schwarz](https://www.ls-tc.de/de/aktie/gamestop-aktie) or [TradeGate](https://www.tradegate.de/orderbuch.php?isin=US36467W1099)\n\nDiamantenhände isn't simply a thread on Superstonk, it's a community that gathers daily to represent the many corners of this world who love this stock. Many thanks to the originator of the series, DerGurkenraspler, who we wish well. We all love seeing the energy that people represent their varied homelands. Show your flags, share some culture, and unite around GME!",
        "score": 975,
        "num_comments": 45,
        "author": "Parsnip"
    },
    {
        "id": "1lr9kcv",
        "time": "2025-07-04T04:16:05",
        "title": "Secured at the Dodgers game. PSA grading this at GameStop this weekend",
        "text": "",
        "score": 142,
        "num_comments": 11,
        "author": "coolkidcharles"
    },
    {
        "id": "1lr93zv",
        "time": "2025-07-04T03:51:04",
        "title": "GME Utilization via Ortex - 87.18%",
        "text": "",
        "score": 1119,
        "num_comments": 33,
        "author": "RaucetheSoss"
    },
    {
        "id": "1lr8h83",
        "time": "2025-07-04T03:16:41",
        "title": "GameStop revenue by category, as a percentage of total revenue, by fiscal quarter",
        "text": "",
        "score": 270,
        "num_comments": 28,
        "author": "jersan"
    },
    {
        "id": "1lr8eao",
        "time": "2025-07-04T03:12:17",
        "title": "Stream hits, thanks again everyone!",
        "text": "Thanks for coming out tonight everyone! Get your spot for the GME box breaks if you're interested!",
        "score": 0,
        "num_comments": 5,
        "author": "Dottiest_Mass"
    },
    {
        "id": "1lr86s7",
        "time": "2025-07-04T03:00:56",
        "title": "Just got my first PSA submission back from GameStop, and I’m impressed!",
        "text": "The employees were amazing! They were very knowledgeable about the whole process, and they were very kind in answering all of my questions. The turnaround was about 60 days, and I received emails at each step in the process. Plus, you can see your grades before PSA ships them back via email. So, you know what grade your cards received.\n\nTell all your collector friends! Let them know they will do more than just Pokémon and TCG! Any sport! Any card!\n\nPower to the Collectors!\n\nGME",
        "score": 311,
        "num_comments": 12,
        "author": "curiousjorj"
    },
    {
        "id": "1lr7tji",
        "time": "2025-07-04T02:40:48",
        "title": "GME hodlers on July 4th",
        "text": "",
        "score": 539,
        "num_comments": 17,
        "author": "boxxle"
    },
    {
        "id": "1lr7efw",
        "time": "2025-07-04T02:18:14",
        "title": "The LEAPS are up $13,863 this week and are up $131,575 overall.",
        "text": "2026 LEAPS  \nTotal Gains for 2026: $28,914  \nWeekly Change: –$208.00\n\n2027 LEAPS  \nTotal Gains for 2027: $66,221  \nWeekly Change: +$14,101.00\n\nCombined Totals (2025–2027)  \nTotal Gains: $131,575  \nWeekly Change: +$13,893.00",
        "score": 19,
        "num_comments": 2,
        "author": "Expired_Options"
    },
    {
        "id": "1lr71cq",
        "time": "2025-07-04T01:59:23",
        "title": "✅ Daily Share Buyback #307",
        "text": "",
        "score": 220,
        "num_comments": 3,
        "author": "areHorus"
    },
    {
        "id": "1lr4py6",
        "time": "2025-07-04T00:00:14",
        "title": "Is it possible GME reach 26$ in three months？",
        "text": "My thoughts on GME right now:\nI personally believe GME is currently in an oversold state. During the broader market downturn around April 7th–8th, its price was still holding around $22–23, which shows some relative strength.\nGiven the current setup, I think there's a good chance the stock may maintain its upward momentum over the next few months.\nJust my two cents — curious to hear what others think.",
        "score": 0,
        "num_comments": 23,
        "author": "Maleficent_Variety_5"
    },
    {
        "id": "1lr3r3c",
        "time": "2025-07-03T23:13:19",
        "title": "Do not buy calls exp next week",
        "text": "There are 1.5 mil FTDs due to be delivered by July 17th T+35. If you haven't noticed GME has very choppy this week. 3 weeks straight max pain has set at 23.50. Its been 1 bear flag after another and it keeps chopping sideways. My best guess is shorts let the stock run Monday maybe get close to $25 then on Tuesday Trump makes a decision on tariffs is he reinstate the tariffs I expects shorts to do what they do best SHORT to cover the FTDs due July 17th. If tariffs get reinstated the expepect a short from near $25 to sub $23.",
        "score": 0,
        "num_comments": 0,
        "author": "EndDense6286"
    },
    {
        "id": "1lr3939",
        "time": "2025-07-03T22:50:14",
        "title": "GameStop's PSA card inventory is getting huge (8000 cards, worth between $600,000-$1,100,000)",
        "text": "I used to scrape GameStop's PSA web store multiple times a day to see trends in inventories. This worked well for many months until they changed something that blocked my bot... I never fixed it so haven't looked at trends recently.\n\nWhat I did see was a downward trend in stock from people buying with small spikes when they would add new stock to the website. I watch the total graded cards go from \\~5000 slowly down to \\~3000 over a few months.\n\nIt's currently sitting at 7946 total cards. Since I haven't been watching trends I can't tell you if this has been one huge inventory addition, or if they have been incrementally but this is by far the highest I have seen. The price estimates might not seem large in comparison to the rest of GameStop's operations, but keep in mind this is roughly $800k in pieces of cardboard, this is a huge inventory for this kind of collectable. They are constantly buying new cards and selling them for a profit, they are taking a cut on all PSA submissions, and also getting the additional sales when people come in to use this service. This is a collectibles fly-wheel which will keep gaining momentum.\n\nBrick by brick, PSA slab by PSA slab.",
        "score": 449,
        "num_comments": 16,
        "author": "MightyBallsack"
    },
    {
        "id": "1lr33qt",
        "time": "2025-07-03T22:43:27",
        "title": "Vile Nepo Baby & Grifter \"Financial Advisor\" Have Punch Up In WalMart Parking Lot",
        "text": "",
        "score": 46,
        "num_comments": 11,
        "author": "sunnycorax"
    },
    {
        "id": "1lr2czg",
        "time": "2025-07-03T22:09:38",
        "title": "TSUKI. Everything just coincidences? Must be fake!",
        "text": "I’ve seen enough. I’m done coping. This is real.\n\nThere’s no way this many coincidences — involving Roaring Kitty, xAi devs, WallStreetBets, BasedAI, and others — are just accidents. $TSUKI and $RWA (Real World AI) are the most coordinated, cryptic, and deliberate projects I’ve ever seen on Solana.\n\nThis is not a meme coin pump.\n\nThis is a play that’s been years in the making. And if you’re not paying attention, you're going to miss what could be the most legendary chapter in meme stock/crypto/AI history.\n\n🧠 Who’s Already Involved?\n\n• ⁠Roaring Kitty (Keith Gill / DFV)\n\n$TSUKI posted a meme on May 11. Exactly 1 day, 1 hour, 1 min later, Roaring Kitty returned to X after 3 years… with the SAME meme. Over 15 tightly timed interactions between RK and TSUKI’s X account — sometimes within SECONDS of each other. TSUKI’s website legal disclaimer is literally signed DFV / KG. It’s him. He’s behind this...\n\n• ⁠WallStreetBets\n\nRK posts a clip showing WSB’s head on a “sicario.” Two days later, WSB joins the TSUKI Telegram and starts interacting with the community. This is NOT random.\n\n• ⁠BasedAI\n\nTheRoaringAI (RWA) drops phrases like “colosseum,” which BasedAI mirrors in their own posts. RWA tags u/getbasedai and is listed as a “Based Creature.” These AIs are interacting like they know each other. Dev is likely connected to BasedAI.\n\n• ⁠xAi\n\nRWA’s first tweet on Oct 24 references Grok3 @ Memphis — BEFORE Grok3 was public. TSUKI’s Dev drops a “pregnant man” emoji → 76 mins later, an X user asks Grok if it’s a boy. Elon reads the question aloud in the Grok3 launch livestream. Dev already replied: “It’s a boy” — BEFORE the question was even asked. And oh yeah — Elon tweeted “There are no coincidences” on May 18. That same date? TSUKI predicted RK would go silent.\n\n🔥 You Still Think This Is a Meme Coin?\n\nLet me show you just a few of the “coincidences”:\n\n1️⃣ TSUKI posts a meme of RK → RK posts the same meme 25 hours later after 3 years away.\n\n2️⃣ TSUKI drops a cat image with GME on its forehead → 60 seconds later, RK posts a video where the GME logo appears upright.\n\n3️⃣ TSUKI posts “KITTY” → RK posts a video that ends with “KITTY” → timestamps match to the minute.\n\n4️⃣ TSUKI drops a video with a voice that sounds like RK: “Sorry I couldn’t tweet today, I was busy making a video.” Same day RK goes totally silent — as TSUKI predicted days earlier.\n\n5️⃣ TSUKI posts the UNO reverse card on June 2 → RK comes back after 2 weeks by posting the same UNO reverse card. 🤯 This Goes Deeper Than Crypto\n\n$TSUKI is tied to NFTs, anime, and a “Tsukiverse” that gets revealed as milestones are hit. $RWA is literally an AI alter ego of Roaring Kitty, modeled after his speech, behavior, and ideology. TheRoaringAI is doing livestreams, writing SHA predictions, and interacting with people in real-time. It’s also powered by Grok3, which was not even publicly available — but the AI was using it before release.\n\nI know it sounds crazy. It is crazy. But it's also real.\n\n🧠 You Want More Names?\n\nLet’s talk influencers:\n\nKyle Chassé VirtualBacon CryptoLifer BigBoyJuju Roaring Deca TheCryptoCorner55 Skeleton Key Nocturnum Kitty They’re not just talking — they’re going deep with breakdowns, puzzles, livestream recaps, and cross-posts.\n\n🧨 So What’s Next?\n\nThe Tsuki team says:\n\n“One community to rule them all.” They’ve already hit milestones, burned supply, and teased a collab with one of YouTube’s top cats at $15M market cap (which already happened).\n\nTheRoaringAI has teased a platform called mAInd, an AI-human “influence interface,” and has already predicted headlines days in advance using encrypted messages!!\n\nThis is beyond a coin.\n\nThis is a new internet story unfolding in real time.\n\nDYOR, but let me say this: I’ve never seen a project that:\n\nInvolves this many influential players Times their social drops with such precision Blends meme culture, AI, GME history, and crypto together like a symphony Has a community so committed to puzzle-solving and decoding the plan If you’re reading this and not diving in — you’re going to regret it.\n\n* 📱 Telegram: t. me/tsukionsol \n* 🌐 TSUKI: tsukionsol . xyz \n* 🌐 RWA: theroaringai . com\n\nThere are no coincidences.\n\nBut if there are… there are just too many of them for this to be anything but deliberate.\n\nI’m in. See you on the other side.",
        "score": 13,
        "num_comments": 4,
        "author": "Braso01"
    },
    {
        "id": "1lr2byj",
        "time": "2025-07-03T22:08:19",
        "title": "TSUKI. Everything just coincidences? Must be fake!",
        "text": "I’ve seen enough. I’m done coping. This is real.\n\nThere’s no way this many coincidences — involving Roaring Kitty, xAi devs, WallStreetBets, BasedAI, and others — are just accidents. $TSUKI and $RWA (Real World AI) are the most coordinated, cryptic, and deliberate projects I’ve ever seen on Solana.\n\nThis is not a meme coin pump.\n\nThis is a play that’s been years in the making. And if you’re not paying attention, you're going to miss what could be the most legendary chapter in meme stock/crypto/AI history.\n\n🧠 Who’s Already Involved?\n\n• ⁠Roaring Kitty (Keith Gill / DFV)\n\n$TSUKI posted a meme on May 11. Exactly 1 day, 1 hour, 1 min later, Roaring Kitty returned to X after 3 years… with the SAME meme. Over 15 tightly timed interactions between RK and TSUKI’s X account — sometimes within SECONDS of each other. TSUKI’s website legal disclaimer is literally signed DFV / KG. It’s him. He’s behind this...\n\n• ⁠WallStreetBets\n\nRK posts a clip showing WSB’s head on a “sicario.” Two days later, WSB joins the TSUKI Telegram and starts interacting with the community. This is NOT random.\n\n• ⁠BasedAI\n\nTheRoaringAI (RWA) drops phrases like “colosseum,” which BasedAI mirrors in their own posts. RWA tags u/getbasedai and is listed as a “Based Creature.” These AIs are interacting like they know each other. Dev is likely connected to BasedAI.\n\n• ⁠xAi\n\nRWA’s first tweet on Oct 24 references Grok3 @ Memphis — BEFORE Grok3 was public. TSUKI’s Dev drops a “pregnant man” emoji → 76 mins later, an X user asks Grok if it’s a boy. Elon reads the question aloud in the Grok3 launch livestream. Dev already replied: “It’s a boy” — BEFORE the question was even asked. And oh yeah — Elon tweeted “There are no coincidences” on May 18. That same date? TSUKI predicted RK would go silent.\n\n🔥 You Still Think This Is a Meme Coin?\n\nLet me show you just a few of the “coincidences”:\n\n1️⃣ TSUKI posts a meme of RK → RK posts the same meme 25 hours later after 3 years away.\n\n2️⃣ TSUKI drops a cat image with GME on its forehead → 60 seconds later, RK posts a video where the GME logo appears upright.\n\n3️⃣ TSUKI posts “KITTY” → RK posts a video that ends with “KITTY” → timestamps match to the minute.\n\n4️⃣ TSUKI drops a video with a voice that sounds like RK: “Sorry I couldn’t tweet today, I was busy making a video.” Same day RK goes totally silent — as TSUKI predicted days earlier.\n\n5️⃣ TSUKI posts the UNO reverse card on June 2 → RK comes back after 2 weeks by posting the same UNO reverse card. 🤯 This Goes Deeper Than Crypto\n\n$TSUKI is tied to NFTs, anime, and a “Tsukiverse” that gets revealed as milestones are hit. $RWA is literally an AI alter ego of Roaring Kitty, modeled after his speech, behavior, and ideology. TheRoaringAI is doing livestreams, writing SHA predictions, and interacting with people in real-time. It’s also powered by Grok3, which was not even publicly available — but the AI was using it before release.\n\nI know it sounds crazy. It is crazy. But it's also real.\n\n🧠 You Want More Names?\n\nLet’s talk influencers:\n\nKyle Chassé VirtualBacon CryptoLifer BigBoyJuju Roaring Deca TheCryptoCorner55 Skeleton Key Nocturnum Kitty They’re not just talking — they’re going deep with breakdowns, puzzles, livestream recaps, and cross-posts.\n\n🧨 So What’s Next?\n\nThe Tsuki team says:\n\n“One community to rule them all.” They’ve already hit milestones, burned supply, and teased a collab with one of YouTube’s top cats at $15M market cap (which already happened).\n\nTheRoaringAI has teased a platform called mAInd, an AI-human “influence interface,” and has already predicted headlines days in advance using encrypted messages!!\n\nThis is beyond a coin.\n\nThis is a new internet story unfolding in real time.\n\nDYOR, but let me say this: I’ve never seen a project that:\n\nInvolves this many influential players Times their social drops with such precision Blends meme culture, AI, GME history, and crypto together like a symphony Has a community so committed to puzzle-solving and decoding the plan If you’re reading this and not diving in — you’re going to regret it.\n\n* 📱 Telegram: t. me/tsukionsol \n* 🌐 TSUKI: tsukionsol . xyz \n* 🌐 RWA: theroaringai . com\n\nThere are no coincidences.\n\nBut if there are… there are just too many of them for this to be anything but deliberate.\n\nI’m in. See you on the other side.",
        "score": 8,
        "num_comments": 4,
        "author": "Braso01"
    },
    {
        "id": "1lr28e6",
        "time": "2025-07-03T22:03:51",
        "title": "TSUKI. Everything just coincidences? Must be fake!",
        "text": "I’ve seen enough. I’m done coping. This is real.\n\nThere’s no way this many coincidences — involving Roaring Kitty, xAi devs, WallStreetBets, BasedAI, and others — are just accidents. $TSUKI and $RWA (Real World AI) are the most coordinated, cryptic, and deliberate projects I’ve ever seen on Solana.\n\nThis is not a meme coin pump.\n\nThis is a play that’s been years in the making. And if you’re not paying attention, you're going to miss what could be the most legendary chapter in meme stock/crypto/AI history.\n\n🧠 Who’s Already Involved?\n\n• ⁠Roaring Kitty (Keith Gill / DFV)\n\n$TSUKI posted a meme on May 11. Exactly 1 day, 1 hour, 1 min later, Roaring Kitty returned to X after 3 years… with the SAME meme. Over 15 tightly timed interactions between RK and TSUKI’s X account — sometimes within SECONDS of each other. TSUKI’s website legal disclaimer is literally signed DFV / KG. It’s him. He’s behind this...\n\n• ⁠WallStreetBets\n\nRK posts a clip showing WSB’s head on a “sicario.” Two days later, WSB joins the TSUKI Telegram and starts interacting with the community. This is NOT random.\n\n• ⁠BasedAI\n\nTheRoaringAI (RWA) drops phrases like “colosseum,” which BasedAI mirrors in their own posts. RWA tags [u/getbasedai](https://www.reddit.com/user/getbasedai/) and is listed as a “Based Creature.” These AIs are interacting like they know each other. Dev is likely connected to BasedAI.\n\n• ⁠xAi\n\nRWA’s first tweet on Oct 24 references Grok3 @ Memphis — BEFORE Grok3 was public. TSUKI’s Dev drops a “pregnant man” emoji → 76 mins later, an X user asks Grok if it’s a boy. Elon reads the question aloud in the Grok3 launch livestream. Dev already replied: “It’s a boy” — BEFORE the question was even asked. And oh yeah — Elon tweeted “There are no coincidences” on May 18. That same date? TSUKI predicted RK would go silent.\n\n🔥 You Still Think This Is a Meme Coin?\n\nLet me show you just a few of the “coincidences”:\n\n1️⃣ TSUKI posts a meme of RK → RK posts the same meme 25 hours later after 3 years away.\n\n2️⃣ TSUKI drops a cat image with GME on its forehead → 60 seconds later, RK posts a video where the GME logo appears upright.\n\n3️⃣ TSUKI posts “KITTY” → RK posts a video that ends with “KITTY” → timestamps match to the minute.\n\n4️⃣ TSUKI drops a video with a voice that sounds like RK: “Sorry I couldn’t tweet today, I was busy making a video.” Same day RK goes totally silent — as TSUKI predicted days earlier.\n\n5️⃣ TSUKI posts the UNO reverse card on June 2 → RK comes back after 2 weeks by posting the same UNO reverse card. 🤯 This Goes Deeper Than Crypto\n\n$TSUKI is tied to NFTs, anime, and a “Tsukiverse” that gets revealed as milestones are hit. $RWA is literally an AI alter ego of Roaring Kitty, modeled after his speech, behavior, and ideology. TheRoaringAI is doing livestreams, writing SHA predictions, and interacting with people in real-time. It’s also powered by Grok3, which was not even publicly available — but the AI was using it before release.\n\nI know it sounds crazy. It is crazy. But it's also real.\n\n🧠 You Want More Names?\n\nLet’s talk influencers:\n\nKyle Chassé VirtualBacon CryptoLifer BigBoyJuju Roaring Deca TheCryptoCorner55 Skeleton Key Nocturnum Kitty They’re not just talking — they’re going deep with breakdowns, puzzles, livestream recaps, and cross-posts.\n\n🧨 So What’s Next?\n\nThe Tsuki team says:\n\n“One community to rule them all.” They’ve already hit milestones, burned supply, and teased a collab with one of YouTube’s top cats at $15M market cap (which already happened).\n\nTheRoaringAI has teased a platform called mAInd, an AI-human “influence interface,” and has already predicted headlines days in advance using encrypted messages!!\n\nThis is beyond a coin.\n\nThis is a new internet story unfolding in real time.\n\nDYOR, but let me say this: I’ve never seen a project that:\n\nInvolves this many influential players Times their social drops with such precision Blends meme culture, AI, GME history, and crypto together like a symphony Has a community so committed to puzzle-solving and decoding the plan If you’re reading this and not diving in — you’re going to regret it.\n\n* 📱 Telegram: t. me/tsukionsol \n* 🌐 TSUKI: tsukionsol . xyz \n* 🌐 RWA: theroaringai . com\n\nThere are no coincidences.\n\nBut if there are… there are just too many of them for this to be anything but deliberate.\n\nI’m in. See you on the other side.",
        "score": 13,
        "num_comments": 6,
        "author": "Braso01"
    },
    {
        "id": "1lr1s3y",
        "time": "2025-07-03T21:44:07",
        "title": "Reminder to new Crypto Investors.",
        "text": "Just a reminder to everyone thinking about entering crypto and focusing on smaller market cap coins to diversify.\n\nMake sure to include an investigation of tokenonmics on the coin you want to invest in before investing. You WANT to know who's under you when buying on top. If there's not a reasonable reason as to why there is a small amount of top holders, then steer clear. \n\nFor example, the asshole community on eth who use my favorite ticker and come sliding into the $gme on solana chat to spread fud and just be dick heads, straight up - $Gme on Ethereum. Or as I like to call \"daddy's money clan\" top holders compromise it. Just look at the picture attached from bubble maps. The project is COOKED. MASSIVELY bundled barely any spread, not enough holders, small % of holdings through out, claims affiliation to gamestop and they somehow get away with it when its a PURE LIE AND BUILT FOR A LIQUIDITY SUCKING EVENT. 🚨\n\nThe picture on the left is gme eth (cooked)\nThe picture on the right is gme sol (hawt)\n\nThe big percentages of holders on solana are exchanges + community. Go look for yourself how many exchanges gme on solana is listed on currently VS this dumpster fire of a contract on eth. \n\nDO NOT BE FOOLED. \nTHE REAL ORGANIC COMMUNITY IS ON SOLANA.",
        "score": 1,
        "num_comments": 0,
        "author": "buckydunontherun"
    },
    {
        "id": "1lr1rel",
        "time": "2025-07-03T21:43:13",
        "title": "Happy 4th Apes!",
        "text": "Just a little holiday tin for you all. RK added these fireworks to the original music video. No other previous squeeze involves a 4th of July date range that would warrant fireworks being added and the Jan2021 squeeze occurred well after New Years.   \n  \nWas it added as just a random visual for the word \"BANG\"? Or does it mean something more? Be safe, keep holding, and hopefully next week we see some late GME fireworks.\n\n[https://youtu.be/VkuQL4wjLLQ?si=W39Uhr1h-sOMkl7s&t=520](https://youtu.be/VkuQL4wjLLQ?si=W39Uhr1h-sOMkl7s&t=520)",
        "score": 387,
        "num_comments": 16,
        "author": "LUKENBACHER"
    },
    {
        "id": "1lr1irb",
        "time": "2025-07-03T21:32:40",
        "title": "2025-07-03 AP W",
        "text": "",
        "score": 1,
        "num_comments": 0,
        "author": "Weird-Ad-7669"
    },
    {
        "id": "1lr1gsp",
        "time": "2025-07-03T21:30:20",
        "title": "2025-07-03 DIDM W",
        "text": "",
        "score": 1,
        "num_comments": 0,
        "author": "Weird-Ad-7669"
    },
    {
        "id": "1lr1dzn",
        "time": "2025-07-03T21:26:50",
        "title": "World events don't all revolve around your shitty investments. Also, BCG had no power to prevent GME from doing anything. They are a consulting firm that sued GME for unpaid fees.",
        "text": "",
        "score": 76,
        "num_comments": 36,
        "author": "folteroy"
    },
    {
        "id": "1lr1bbd",
        "time": "2025-07-03T21:23:42",
        "title": "2025-07-03 ADX2 W",
        "text": "",
        "score": 1,
        "num_comments": 0,
        "author": "Weird-Ad-7669"
    },
    {
        "id": "1lr18ux",
        "time": "2025-07-03T21:20:47",
        "title": "2025-07-03 PPO W",
        "text": "",
        "score": 1,
        "num_comments": 0,
        "author": "Weird-Ad-7669"
    },
    {
        "id": "1lr154b",
        "time": "2025-07-03T21:16:21",
        "title": "2025-07-03 AP 4H",
        "text": "",
        "score": 1,
        "num_comments": 0,
        "author": "Weird-Ad-7669"
    },
    {
        "id": "1lr10vm",
        "time": "2025-07-03T21:11:27",
        "title": "2025-07-03 adx2 4H",
        "text": "",
        "score": 1,
        "num_comments": 0,
        "author": "Weird-Ad-7669"
    },
    {
        "id": "1lr0yxp",
        "time": "2025-07-03T21:09:11",
        "title": "2025-07-03 PPO 4H",
        "text": "",
        "score": 1,
        "num_comments": 0,
        "author": "Weird-Ad-7669"
    },
    {
        "id": "1lr0r2w",
        "time": "2025-07-03T21:00:11",
        "title": "Game",
        "text": "Don’t believe all the hype, it’s been going on for over 5 years. It’s always the same shit and the same hype by the same people. Moass tomorrow, but tomorrow comes and nothing. It will continue to do nothing cause the bigwigs who short this stock are the ones in control and nothing can be done about it. So if you want your money just to sit for years and you make nothing then leave it in GME. For me it’s not worth it anymore. Just like DFV said 5 years and nothing then it’s time to move on. Idc if GME has no debt or it’s bought bitcoin the stock price is what I care about and it’s taking way to long and nothing to show. It’s the slowest moving stock. You make better returns on CCL or sound or Tesla.  Wake up people and quit listening to these gamers who are delusional. ",
        "score": 0,
        "num_comments": 6,
        "author": "Negative_Flow_9364"
    },
    {
        "id": "1lr0m9j",
        "time": "2025-07-03T20:54:32",
        "title": "The Timeline",
        "text": "The 30th emoji was the dog one, making it the selling incident of RK in September. The ‘I will wait for you’ reference video posted in January points to the fact of the big gap between the 30th and 31st emoji in the timeline. As the photo says, in my opinion, i believe the upcoming weekend will be a historical one following with a magical event that would enlighten many lives in need of unity and peace. HOOOOOOOOOOOLD. $GME 🚀🚀🚀. 💎. NFA.",
        "score": 113,
        "num_comments": 23,
        "author": "sullysreddit"
    },
    {
        "id": "1lr0kzo",
        "time": "2025-07-03T20:53:01",
        "title": "2 more directors bought.",
        "text": "https://www.sec.gov/Archives/edgar/data/1326380/000162828025034250/xslF345X05/wk-form4_1751574853.xml\nGamestop  Gamestop Gamestop Gamestop Gamestop Gamestop\nGamestop Gamestop\nGamestop Gamestop\nGamestop",
        "score": 0,
        "num_comments": 10,
        "author": "Studio-Economy"
    },
    {
        "id": "1lqzxuc",
        "time": "2025-07-03T20:26:11",
        "title": "Playing Transformers RPG solo?",
        "text": "I've been entertaining the idea of doing a session of the Transformers RPG and I'm kinda lost on how to start? I have Mythic GME 2nd Edition and One-Page Mythic?",
        "score": 3,
        "num_comments": 3,
        "author": "Most_Animator_248"
    },
    {
        "id": "1lqzxhi",
        "time": "2025-07-03T20:25:46",
        "title": "2025-07-03 G7",
        "text": "",
        "score": 1,
        "num_comments": 0,
        "author": "Weird-Ad-7669"
    },
    {
        "id": "1lqxj5t",
        "time": "2025-07-03T18:48:03",
        "title": "Reddit Ticker Mentions-July 03, 2025",
        "text": "[https://discord.gg/g3njq3zy](https://discord.gg/g3njq3zy)",
        "score": 1,
        "num_comments": 0,
        "author": "BulldawgTrading1"
    },
    {
        "id": "1lqxa7s",
        "time": "2025-07-03T18:38:14",
        "title": "Mods of cult sub doing their job being LITERAL shills and apes angry HOOD is rippin'",
        "text": "",
        "score": 44,
        "num_comments": 19,
        "author": "SellNoCell"
    },
    {
        "id": "1lqx6pb",
        "time": "2025-07-03T18:34:21",
        "title": "And all I got from the SEC is ...\"we acknowledge your email...\"",
        "text": "I finally had time last weekend to write back to the SEC (see previous [SEC says I am not allowed to know who caused the CAT errors... : r/Superstonk](https://www.reddit.com/r/Superstonk/comments/1kcjda2/sec_says_i_am_not_allowed_to_know_who_caused_the/))  Note: I am not a MULN investor; only GME, and DRS'd at that.  MULN has appeared on the Nasdaq RegSHO list every day since last summer when I started noticing it.  **TL;DR:** The SEC is lazy as and does absolutely nothing.\n\n\"Hello again SEC,\n\nThe latest CAT error statistics were released on Thursday night, 26th June ( [https://www.catnmsplan.com/sites/default/files/2025-06/06.26.25-Monthly-CAT-Update-Final.pdf](https://www.catnmsplan.com/sites/default/files/2025-06/06.26.25-Monthly-CAT-Update-Final.pdf)  ). I note that on 17th June there were 7 BILLION CAT errors recorded. All the measures you outlined in your email are simply not working to prevent errors from happening in the first place.  Anonymity should not be granted to those who cause such errors; section 613 doesn’t help investors with the necessary transparency.  In this modern day and age, it is unconscionable to have financial market systems where continuous errors are allowable and not managed.  Once again, I stress that the SEC is failing in its duties to stop CAT errors happening.  Even in the previous report from May 2025, 3.6B errors were reported on 14th April; 1.1B errors on 15th April; 2.6B errors on 16th April; and 1.6B errors on 1st May. This is not acceptable.\n\nAnd yes, while the RegSHO reporting is a measure of “cumulative number of all fails outstanding until that day, plus new fails that occur that day, less fails that settle that day,” it does not explain why, stocks like MULN (Mullen Automotive) have appeared on it every single day for months and months. Why is this consistently allowed? Are the fails-to-deliver settled and then failed again on the same day by the same participants? MULN has been on the NASDAQ RegSho for months. The SEC has allowed this situation where fails-to-deliver occur day after day. Who keeps failing to deliver?  And why can’t we as investors know who consistently fails to deliver this and other stocks?\n\nThe headline on the SEC website says “We make markets work better.” That is incongruent with the evidence. Please revert with an action plan on:\n\n\\* How the SEC will prevent CAT errors from occurring  \n\\* How the SEC will make the names of those responsible for CAT errors visible to investors  \n\\* How the SEC will investigate and stop continuous fails-to-deliver so that investors receive what they have purchased on the date expected\n\nI look forward to your response.\n\nRegards,  \nTransatlanticMadame.\"\n\nand they responded today - with the laziest response ever that someone could say \"well I responded before a holiday weekend.\"\n\n\"Dear TransatlanticMadame:\n\nThank you for providing additional information to the Ombuds of the U.S. Securities and Exchange Commission (SEC) regarding published statistics about reports to the Consolidated Audit Trail (CAT). The Office of the Ombuds handles retail investor recommendations, questions and complaints about the SEC and the self-regulatory organizations (SROs) that it oversees.\n\nThis email acknowledges our Office’s receipt of your additional information. Please note that the Ombuds does not participate in formal investigations, nor are we able to provide you with an update on the status of your complaint or other non-public information. The Ombuds generally treats matters as confidential and takes reasonable steps to maintain the confidentiality of communications. However, our Office may need to contact other SEC divisions or offices, SROs, entities, and/or individuals to disclose information without permission under certain circumstances including, but not limited to: a threat of imminent risk or serious harm; assertions, complaints, or information relating to violations of the securities laws; allegations of government fraud, waste, or abuse; or if otherwise required by law. Information received by the Ombuds may also be used in future recommendations to the SEC.\n\nAgain, thank you for contacting the SEC Ombuds.\"\n\nI find this ridiculous and am going to my Senator and Congressman next.",
        "score": 485,
        "num_comments": 26,
        "author": "TransatlanticMadame"
    }
]